* Check python version
#+BEGIN_SRC python
import sys
return sys.version
#+END_SRC

#+RESULTS:
: 3.5.2 (default, Sep 18 2016, 03:17:32) 
: [GCC 5.4.0 20160609]

* Domains
#+BEGIN_SRC python
  # ignore certicate validation
  import ssl
  ctx = ssl.create_default_context()
  ctx.check_hostname = False
  ctx.verify_mode = ssl.CERT_NONE

  import urllib.request
  from bs4 import BeautifulSoup
  output = []
  domains = ['www.emccompo2017.eltech.ru', 'www.eltech.ru', 'www.euntqm.eltech.ru', 'nnb.eltech.ru', 'mdl.eltech.ru', 'kepstr.eltech.ru', 'etest.eltech.ru', 'eltech.ru', 'bp.eltech.ru', 'csat.eltech.ru', 'www.ascor.eltech.ru']
  for domain in domains:
      try:
          webpage = 'http://' + domain
          html_doc = urllib.request.urlopen(webpage, context=ctx)
          soup = BeautifulSoup(html_doc, 'html.parser')
          title = soup.title
          if title is not None:
              title = title.string
              output.append({webpage: title})
      except:
          pass

  formated_output = []
  for line in output:
      for webpage,title in line.items():
          formated_output.append('[[{}][{}]]'.format(webpage, title))

  return formated_output
#+END_SRC

#+RESULTS:
- [[http://www.emccompo2017.eltech.ru][The 11th International Workshop On The Electromagnetic Compatibility Of Integrated Circuits]]
- [[http://www.eltech.ru][СПбГЭТУ «ЛЭТИ»]]
- [[http://www.euntqm.eltech.ru][ European Universities Network for Total Quality Management EUN.TQM ]]
- [[http://nnb.eltech.ru][Международная конференция для школьников и поступающих в магистратуру «Наука настоящего и будущего»]]
- [[http://kepstr.eltech.ru][Kepstr - Телекоммуникации Бугалтерский и финансовый учет Антенны и техника СВЧ Неразрушающий контроль.]]
- [[http://etest.eltech.ru][Questionmark Perception - ]]
- [[http://eltech.ru][СПбГЭТУ «ЛЭТИ»]]
- [[http://bp.eltech.ru][Сетевое взаимодействие вузов по основным направлениям Болонского процесса]]
- [[http://csat.eltech.ru][Научно-исследовательская группа компьютерных систем и технологий]]
- [[http://www.ascor.eltech.ru][None]]

